INDEXING CSECT
		 BALR  12,0
		 USING BASE,12
* COMPUTE W = X - Y + Z		 
BASE	 L	   2,X
		 S     2,Y
		 A	   2,Z
		 ST    2,W
* SAME COMPUTATION USING REGISTER 3 AS AN INDEX REGISTER
         WTO   'START SAME COMPUTATION WITH INDEX REGISTER'
		 L     3,ZERO
		 L     2,X(3)
		 A     3,FOUR
		 S     2,X(3)
		 BCR   X'F',14
X		 DC    F'160'
Y		 DC    F'2'
Z		 DC    F'10'
W		 DS    F
ZERO     DC    F'0'
FOUR     DC    F'4'
		 END   INDEXING